### Reading a csv file

In [1]:
import pandas as pd
df = pd.read_csv('data/weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

### Reading a excel sheet

In [3]:
df = pd.read_excel('data/weather_data.xlsx','Sheet1')
df

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02           35          7  Sunny
2 2017-01-03           28          2   Snow

### Reading from python dict

In [5]:
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'windspeed': [6,7,2],
    'event': ['Rain', 'Sunny', 'Snow']
}
df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

### Reading CSV

In [6]:
df = pd.read_csv('data/stock_data.csv')
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [ ]:
# if we dont have a header df = pd.read_csv('data/stock_data.csv', header=None)
# if we want to limit the rows read  we can use nrows argument

### Changing the data

In [10]:
dfNa = pd.read_csv('data/stock_data.csv', na_values=['n.a.','not available' ])
# in here n.a. values to nan values
dfNa

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [11]:
dfNa = pd.read_csv('data/stock_data.csv', na_values={
    'eps':['n.a.', 'not available'],
    'revenue':[-1],
    'price':['n.a.', 'not available'],
    'people':['n.a.']
})
# in here n.a. values to nan values
dfNa

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

### Write CSV

In [12]:
df.to_csv('data/mungled_stock_data.csv', index=False)

In [ ]:
# if we want particuler columns only
#df.to_csv('data/mungled_stock_data.csv', index=False, columns = [tickers, eps])

### Read Excel

In [14]:
df = pd.read_excel('data/stock_data.xlsx')
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

Changing the cells while reading the file

In [16]:
# use function while reading the column
# in here I want to print sam if cell == n.a.

def converter_people_cell(cell):
    if cell == 'n.a.':
        return 'sam'
    return cell


df = pd.read_excel('data/stock_data.xlsx', converters={
    'people':converter_people_cell
})
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65            sam
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

Write Excel

In [19]:
df.to_excel('data/mungled_stock_data.xlsx', index=False)

###### Write into different sheet

In [20]:
df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64 ],
    'pe': [30.37, 14.26, 30.97],
    'eps': [27.82, 4.61, 2.12]
})

df_weather =  pd.DataFrame({
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'event': ['Rain', 'Sunny', 'Snow']
})

In [26]:
with pd.ExcelWriter('data/stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name='stocks', index=False)
    df_weather.to_excel(writer, sheet_name='weather', index=False)